Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/OmegaT_ESP32-level2.tmx
Source language: en_us
Languages: it_it

source: Touch Pads The board has 9 capacitive touch-sensing GPIOs.
it_it: Touch Pad La scheda dispone di 9 GPIO capacitivi con rilevamento del tocco.

source: Touch Sensor
it_it: Sensore Touch

source: Troubleshooting
it_it: Risoluzione dei Problemi

source: Troubleshooting - Booting up ESP32
it_it: Risoluzione dei problemi - Avvio dell'ESP32

source: Try ``python3`` instead of ``python`` if you get the error: ``IOError: [Errno socket error] [SSL: TLSV1_ALERT_PROTOCOL_VERSION] tlsv1 alert protocol version (_ssl.c:590)`` when running ``python get.py``
it_it: Provare ``python3`` invece di ``python`` se si riceve l'errore: ``IOError: [Errno socket error] [SSL: TLSV1_ALERT_PROTOCOL_VERSION] tlsv1 alert protocol version (_ssl.c:590)`` quando si esegue ``python get.py``

source: Try refreshing the page-you’ll notice that the counter increases each time.
it_it: Provare ad aggiornare la pagina: si noterà che il contatore aumenta ogni volta.

source: Tutorials
it_it: Tutorial

source: Two 8-bit DACs to generate true analog voltages
it_it: Due DAC a 8 bit per generare tensioni analogiche reali

source: Two-Wire Automotive Interface (TWAI®, compatible with ISO11898-1)
it_it: Two-Wire Automotive Interface (TWAI®, compatibile con ISO11898-1)

source: Tx pin, used for flashing and debugging
it_it: Pin Tx, utilizzato per il flashing e il debug

source: Type
it_it: Tipo

source: Type [1]_
it_it: Tipo [1]_

source: Type “ds18b20” in the search box to filter your results.
it_it: Digitare "ds18b20" nella casella di ricerca per filtrare i risultati.

source: UART Interface
it_it: Interfaccia UART

source: UART Pins The ESP32 dev.
it_it: Pin UART La scheda ESP32 dev.

source: UART provides hardware management of the CTS and RTS signals and software flow control (XON and XOFF) as well.
it_it: UART fornisce la gestione hardware dei segnali CTS e RTS e il controllo di flusso software (XON e XOFF).

source: UART0 pins are connected to the USB-to-Serial converter and are used for flashing and debugging.
it_it: I pin UART0 sono collegati al convertitore USB-seriale e vengono utilizzati per il flashing e il debug.

source: UART1 pins are reserved for the integrated flash memory chip.
it_it: I pin UART1 sono riservati al chip di memoria flash integrato.

source: UART2, on the other hand, is a safe option for connecting to UART-devices such as GPS, fingerprint sensor, distance sensor, and so on.
it_it: UART2, invece, è un'opzione sicura per la connessione a dispositivi UART come GPS, sensore di impronte digitali, sensore di distanza e così via.

source: UUID: a 128-bit universally unique identifier that indicates what the characteristic represents.
it_it: UUID: un identificatore univoco universale a 128 bit che indica cosa rappresenta la caratteristica.

source: UUIDs (Universally Unique Identifiers) uniquely identify services and characteristics in BLE.
it_it: Gli UUID (Universally Unique Identifier) ​​identificano in modo univoco servizi e caratteristiche in BLE.

source: UUIDs ensure that services and characteristics can be uniquely identified.
it_it: Gli UUID garantiscono l'identificazione univoca di servizi e caratteristiche.

source: Ultra-Low Power Consumption
it_it: Consumo Energetico Estremamente Basso

source: Unfortunately, neither of these libraries is available in the Arduino IDE Library Manager for installation.
it_it: Purtroppo, nessuna di queste librerie è disponibile per l'installazione nel Library Manager dell'IDE di Arduino.

source: Unlike GAP, which defines the low-level interactions with devices, GATT deals only with actual data transfer procedures and formats.
it_it: A differenza di GAP, che definisce le interazioni di basso livello con i dispositivi, GATT si occupa solo delle procedure e dei formati di trasferimento dati effettivi.

source: Up to 16MB
it_it: Fino a 16 MB

source: Up to 4MB (usually 512KB to 1MB included)
it_it: Fino a 4 MB (solitamente da 512 KB a 1 MB inclusi)

source: Up to 64-Byte FIFO
it_it: FIFO fino a 64 byte

source: Up to 80 MHz and the divided clocks of 80 MHz
it_it: Fino a 80 MHz e clock divisi da 80 MHz

source: Update the following two variables with your network credentials so that the ESP32 can connect to your network.
it_it: Aggiornare le due variabili seguenti con le credenziali di rete in modo che l'ESP32 possa connettersi.

source: Upload sketch (Ctrl+U)
it_it: Upload dello sketch (Ctrl+U)

source: Uploading the Code
it_it: Caricamento del Codice

source: Upon loading, a new WebSocket connection is established to the server using the current hostname (ESP32’s IP address) and the special protocol ws:// in the URL.
it_it: Al caricamento, viene stabilita una nuova connessione WebSocket al server utilizzando il nome host corrente (indirizzo IP di ESP32) e il protocollo speciale ws:// nell'URL.

source: Upto 240MHz Clock Freq.
it_it: Frequenza di clock fino a 240 MHz

source: Use them only when absolutely necessary.
it_it: Usarli solo quando assolutamente necessario.

source: Useful Guides
it_it: Guide Utili

source: Users in China might have troubles with connection and download speeds using GitHub.
it_it: Gli utenti in Cina potrebbero riscontrare problemi di connessione e velocità di download utilizzando GitHub.

source: Users in China might have troubles with connection and download speeds using the links above.
it_it: Gli utenti in Cina potrebbero riscontrare problemi di connessione e velocità di download utilizzando i link sopra.

source: Users in China must select the package version with the "-cn" suffix and perform updates manually.
it_it: Gli utenti in Cina devono selezionare la versione del pacchetto con il suffisso "-cn" ed eseguire gli aggiornamenti manualmente.

source: Using BLE on the ESP32
it_it: Utilizzo di BLE su ESP32

source: Using it instead of the Arduino IDE makes it easier to do automated and production builds.
it_it: Utilizzarlo al posto dell'IDE Arduino semplifica la creazione di build automatizzate e di produzione.

source: Using the nRF Connect to Test
it_it: Utilizzo di nRF Connect per il test

source: V power supply
it_it: V alimentazione

source: VSPI pins are commonly used in standard libraries.
it_it: I pin VSPI sono comunemente utilizzati nelle librerie standard.

source: Value: is the actual data that is stored in the characteristic.
it_it: Valore: sono i dati effettivamente memorizzati nella caratteristica.

source: Voltage of Internal LDO (VDD_SDIO)
it_it: Tensione dell'LDO interno (VDD_SDIO)

source: WL_CONNECTED : Connected to a Wi-Fi network.
it_it: WL_CONNECTED : Connesso a una rete Wi-Fi.

source: WL_CONNECTION_LOST : The connection to the network was lost.
it_it: WL_CONNECTION_LOST : La connessione alla rete è stata persa.

source: WL_CONNECT_FAILED : Failed to connect after all attempts.
it_it: WL_CONNECT_FAILED : Impossibile connettersi dopo tutti i tentativi.

source: WL_DISCONNECTED : Not connected to any network.
it_it: WL_DISCONNECTED : Non connesso a nessuna rete.

source: WL_IDLE_STATUS : Temporary status during the connection attempt after calling WiFi.begin() .
it_it: WL_IDLE_STATUS : Stato temporaneo durante il tentativo di connessione dopo la chiamata a WiFi.begin() .

source: WL_NO_SHIELD : No Wi-Fi shield detected (not applicable to ESP32, but relevant for some Arduino boards).
it_it: WL_NO_SHIELD : Nessuno shield Wi-Fi rilevato (non applicabile a ESP32, ma rilevante per alcune board Arduino).

source: WL_NO_SSID_AVAIL : No networks found matching the specified SSID.
it_it: WL_NO_SSID_AVAIL : Nessuna rete trovata corrispondente all'SSID specificato.

source: WL_SCAN_COMPLETED : The network scan has completed.
it_it: WL_SCAN_COMPLETED : La scansione della rete è stata completata.

source: WS_EVT_CONNECT - when a new client connects to the WebSocket server
it_it: WS_EVT_CONNECT - quando un nuovo client si connette al server WebSocket

source: WS_EVT_DATA - when the WebSocket server receives data from a client
it_it: WS_EVT_DATA - quando il server WebSocket riceve dati da un client

source: WS_EVT_DISCONNECT - when a client disconnects from the WebSocket server
it_it: WS_EVT_DISCONNECT - quando un client si disconnette dal server WebSocket

source: WS_EVT_ERROR - when the client reports an error
it_it: WS_EVT_ERROR - quando il client segnala un errore

source: WS_EVT_PONG - when the WebSocket receives a ping request
it_it: WS_EVT_PONG - quando il WebSocket riceve una richiesta ping

source: Wait for git to pull any changes and close ``Git GUI``
it_it: Attendere che git esegua il pull delle modifiche e chiudere ``Git GUI``

source: Warning:
it_it: Avvertenza:

source: We also create a simple integer variable named counter and set it to 0.
it_it: Creiamo anche una semplice variabile intera denominata counter e la impostiamo a 0.

source: We also have the troubleshooting guide to save your time on the most common issues reported by users.
it_it: Abbiamo anche una guida alla risoluzione dei problemi per far risparmiare tempo sui problemi più comuni segnalati dagli utenti.

source: We also include a tag that makes sure the page looks good on all screen sizes, like phones and tablets.
it_it: Includiamo anche un tag che garantisce la visualizzazione ottimale della pagina su schermi di tutte le dimensioni, come quelli di telefoni e tablet.

source: We also include some CSS styling to make the page look attractive.
it_it: Abbiamo anche incluso un po' di stile CSS per rendere la pagina più accattivante.

source: We also print a message to the Serial Monitor.
it_it: Inoltre, stampiamo un messaggio sul Monitor Seriale.

source: We are looking for contributors!
it_it: Siamo alla ricerca di collaboratori!

source: We do this using the server.on() function.
it_it: Lo facciamo utilizzando la funzione server.on() .

source: We format it to show only one decimal point.
it_it: La formattiamo in modo che mostri solo una virgola decimale.

source: We have packages available for Windows, macOS, and Linux.
it_it: Disponiamo di pacchetti per Windows, macOS e Linux.

source: We print this IP address to the Serial Monitor using WiFi.localIP() .
it_it: Indichiamo questo indirizzo IP sul Serial Monitor tramite WiFi.localIP() .

source: We recommend you install it using the boards manager.
it_it: Consigliamo di installarlo utilizzando il "boards manager".

source: We recommend you install the support using your favorite IDE, but other options are available depending on your operating system.
it_it: Raccomandiamo do installare il supporto utilizzando l'IDE preferito, ma sono disponibili altre opzioni a seconda del sistema operativo.

source: We set things like the font styles, the colors, how big the headings are, and even the design of our virtual toggle switches, including their size, shape, and how they animate when clicked.
it_it: Impostiamo elementi come lo stile dei font, i colori, la dimensione delle intestazioni e persino il design dei nostri switch virtuali, incluse le dimensioni, la forma e l'animazione quando vengono cliccati.

source: We start by including two important libraries: WiFi.h and WebServer.h.
it_it: Iniziamo includendo due importanti librerie: WiFi.h e WebServer.h.

source: We start with the essential tags like <!DOCTYPE html> , , , and .
it_it: Iniziamo con i tag essenziali come <!DOCTYPE html> , , e .

source: We tell this object to listen on port 80.
it_it: Indichiamo a questo oggetto di ascoltare sulla porta 80.

source: We then take this temperature reading and store it in our Temperature variable.
it_it: Quindi prendiamo questa lettura della temperatura e la memorizziamo nella nostra variabile Temperature .

source: We use the server.on() function for this.
it_it: Utilizziamo la funzione server.on() per questo.

source: We will be using the Arduino IDE to program the ESP32, so please ensure you have the ESP32 add-on installed before you proceed:
it_it: Useremo l'IDE Arduino per programmare l'ESP32, quindi assicuratevi di aver installato il componente aggiuntivo ESP32 prima di procedere:

source: We will design a web page featuring a toggle switch that allows users to change the state of GPIO 2, which corresponds to the on-board LED.
it_it: Progetteremo una pagina web con uno switch che consente agli utenti di modificare lo stato del GPIO 2, corrispondente al LED integrato.

source: We won’t focus solely on the fastest MCU, the most power-efficient one, or the one offering the best value for money.
it_it: Non ci concentreremo esclusivamente sulla MCU più veloce, quella più efficiente dal punto di vista energetico o quella che offre il miglior rapporto qualità-prezzo.

source: WebSocket is the name of a communication protocol that enables bi-directional (full-duplex, to be more precise) communication between a client and a web server.
it_it: WebSocket è il nome di un protocollo che consente la comunicazione bidirezionale (full-duplex, per essere più precisi) tra un client e un server web.

source: Welcome to ESP32 Arduino Core's documentation
it_it: Benvenuti alla documentazione di ESP32 Arduino Core

source: Welcome to the Arduino ESP32 support documentation!
it_it: Benvenuti nella documentazione di supporto di Arduino ESP32!

source: Well, it’s actually super simple and clever.
it_it: Beh, in realtà è semplicissimo e ingegnoso.

source: We’ll connect a DS18B20 temperature sensor to the ESP32, and display live temperature readings on a web page.
it_it: Collegheremo un sensore di temperatura DS18B20 all'ESP32 e visualizzeremo le letture della temperatura in tempo reale su una pagina web.

source: We’ll look into that later.
it_it: Approfondiremo questo aspetto più avanti.

source: We’ll start by having the ESP32 set up a web server in Station (STA) mode, just like in previous examples.
it_it: Inizieremo configurando l'ESP32 in modalità Station (STA), proprio come negli esempi precedenti.

source: We’re going to control these physical things by simply visiting a specific web address, also known as a URL.
it_it: Controlleremo queste cose fisiche semplicemente visitando un indirizzo web specifico, noto anche come URL.

source: What Is WebSocket?
it_it: Cos'è WebSocket?

source: What happens if two users try to switch the light bulb on or off at the same time?
it_it: Cosa succede se due utenti provano ad accendere o spegnere la lampadina contemporaneamente?

source: What is a Core?
it_it: Cos'è un Core?

source: What is a Web server and how does it work?
it_it: Cos'è un server Web e come funziona?

source: What makes the ESP32 particularly versatile is that it can actually operate in both modes simultaneously, which is called AP+STA mode or dual mode.
it_it: Ciò che rende l'ESP32 particolarmente versatile è la sua capacità di funzionare in entrambe le modalità contemporaneamente, chiamata modalità AP+STA o "dual mode".

source: What’s important is that AJAX lets your web browser request only the specific piece of information it needs-like just the temperature reading-without reloading the entire page.
it_it: L'importante è che AJAX consenta al browser web di richiedere solo l'informazione specifica di cui ha bisogno, come la sola lettura della temperatura, senza ricaricare l'intera pagina.

source: When ```get.exe``` finishes, you should see the following files in the directory
it_it: Al termine di ```get.exe```, si vedranno i seguenti file nella directory

source: When a capacitive load (such as a human finger) is in close proximity to the GPIO, the ESP32 detects the change in capacitance.
it_it: Quando un carico capacitivo (come un dito umano) si trova in prossimità del GPIO, l'ESP32 rileva la variazione di capacità.

source: When a client sends an HTTP_GET request to this root path, the lambda function (inside the curly braces { ... }) gets executed.
it_it: Quando un client invia una richiesta HTTP_GET a questo "root path", viene eseguita la funzione lambda (tra parentesi graffe { ... }).

source: When a user toggles the LED switch on the web page, a “toggle” message will be sent to the ESP32.
it_it: Quando un utente attiva l'interruttore del LED sulla pagina web, verrà inviato un messaggio di “toggle” all'ESP32.

source: When a valid “toggle” message is received, this function toggles the LED, and notifies all connected clients of this change using the textAll() method.
it_it: Quando viene ricevuto un messaggio "toggle" valido, questa funzione attiva/disattiva il LED e notifica la modifica a tutti i client connessi tramite il metodo textAll() .

source: When compared to other platforms, the Arduino IDE is the most user-friendly for beginners.
it_it: Rispetto ad altre piattaforme, l'IDE Arduino è il più intuitivo per i principianti.

source: When comparing two microcontrollers, it’s important to know what types of peripheral interfaces they have.
it_it: Quando si confrontano due microcontrollori, è importante conoscere il tipo di interfacce periferiche di cui dispongono.

source: When it comes to ESP32 development boards, the ESP32 DevKit v1 is by far the most widely used option.
it_it: Quando si tratta di schede di sviluppo ESP32, l'ESP32 DevKit v1 è di gran lunga l'opzione più utilizzata.

source: When it comes to onboard sensors, the ESP8266 is quite minimalistic; it does not have any built-in sensors.
it_it: Per quanto riguarda i sensori integrati, l'ESP8266 è piuttosto minimalista; non ha sensori integrati.

source: When pulled HIGH, the chip is enabled; when pulled LOW, the chip is disabled.
it_it: Quando impostato su HIGH, il chip è abilitato; quando impostato su LOW, il chip è disabilitato.

source: When pulled HIGH, the chip is enabled; when pulled LOW, the chip operates at low power.
it_it: Quando è impostato su HIGH, il chip è abilitato; quando è impostato su LOW, il chip funziona a basso consumo.

source: When someone toggles the LED switch on the page, the LED’s state is instantly updated across all browsers connected to the server.
it_it: Quando qualcuno attiva l'interruttore del LED sulla pagina, il suo stato viene aggiornato istantaneamente su tutti i browser connessi al server.

source: When the ESP32 receives that request, it increases the visitor counter by one, and then sends back an updated web page to your browser, showing the new counter value.
it_it: Quando l'ESP32 riceve questa richiesta, aumenta il contatore dei visitatori di uno e invia una pagina web aggiornata al browser, mostrando il nuovo valore del contatore.

source: When the ESP32 receives this message, it will toggle the LED and immediately notify all connected clients (browsers) by sending either a “1” (indicating LED on) or a “0” (indicating LED off).
it_it: Quando l'ESP32 riceve questo messaggio, attiva/disattiva il LED e avvisa immediatamente tutti i client connessi (browser) inviando un "1" (che indica LED acceso) o uno "0" (che indica LED spento).

source: When the ESP32 receives this request, it’s smart enough to figure out that by seeing the /led1on part of the address, you want to turn the first LED on.
it_it: Quando l'ESP32 riceve questa richiesta, è abbastanza intelligente da capire che, vedendo la parte /led1on dell'indirizzo, si desidera accendere il primo LED.

source: When the code is uploaded, the LED will begin to blink.
it_it: Una volta caricato il codice, il LED inizierà a lampeggiare.

source: When the connection is opened, closed, or encounters an error, we simply print a message to the web console.
it_it: Quando la connessione viene aperta, chiusa o si verifica un errore, viene semplicemente visualizzato un messaggio sulla console web.

source: When the server responds with the temperature information, the code takes that data and inserts it into the specific container on your webpage that has the ID “temperature-container”.
it_it: Quando il server risponde con le informazioni sulla temperatura, il codice prende quei dati e li inserisce nello specifico contenitore sulla pagina web con ID "temperature-container".

source: When the switch is toggled on or off (i.e., when the state of the ‘toggle-btn’ checkbox changes), a message “toggle” is sent over the WebSocket connection, informing the ESP32 to toggle the LED.
it_it: Quando viene attivato o disattivato (ovvero, quando cambia lo stato della casella di controllo "toggle-btn"), viene inviato un messaggio "toggle" tramite la connessione WebSocket, che informa l'ESP32 di attivare o disattivare il LED.

source: When the web server receives your browser’s request, it quickly searches through its stored files to find the webpage you asked for (like HTML documents, images, videos, and other content that makes up a website).
it_it: Quando il server web riceve la richiesta del browser, cerca rapidamente nei file memorizzati per trovare la pagina web richiesta (come documenti HTML, immagini, video e altri contenuti che compongono un sito web).

source: When working with websockets, clients may frequently connect and disconnect, or their connections may drop unexpectedly.
it_it: Quando si lavora con i websocket, i client possono connettersi e disconnettersi frequentemente, oppure le loro connessioni possono interrompersi inaspettatamente.

source: When you click a button on that web page, the ESP32 will respond by turning the LEDs on or off based on your action.
it_it: Quando si clicca su un pulsante sulla pagina web, l'ESP32 risponderà accendendo o spegnendo i LED in base all'azione.

source: When you decide to visit a website-say, www.google.com-your computer first needs to find the right web server where that website lives.
it_it: Quando si decide di visitare un sito web, ad esempio www.google.com, il computer deve prima trovare il server web corretto in cui risiede quel sito.

source: When you do this, your phone itself creates a small Wi-Fi network that your friends can connect to.
it_it: In questo modo, il telefono crea una piccola rete Wi-Fi a cui gli amici possono connettersi.

source: When you open a web browser on your phone or computer and type in a specific address (like http://192.168.1.1/ - don’t worry, your ESP32 will tell you its exact address!), your browser sends a request to the ESP32.
it_it: Quando si apre un browser web sul telefono o computer e si digita un indirizzo specifico (come http://192.168.1.1/ - non c'è da preoccuparsi, l'ESP32 dirà l'indirizzo esatto!), il browser invia una richiesta all'ESP32.

source: When you type a website address into your browser or click on a link, you’re essentially placing an order with a webserver.
it_it: Quando si digita l'indirizzo di un sito web nel browser o si clicca su un link, si sta essenzialmente effettuando un ordine a un server web.

source: When your ESP32 is in AP mode, it creates its own Wi-Fi network, assigning it an SSID (the network’s name), a password, and an IP address.
it_it: Quando l'ESP32 è in modalità AP, crea la propria rete Wi-Fi, assegnandole un SSID (il nome della rete), una password e un indirizzo IP.

source: When your ESP32 is in STA mode, it acts like any other device, such as your laptop or smartphone, that wants to connect to an existing Wi-Fi network.
it_it: Quando l'ESP32 è in modalità STA, si comporta come qualsiasi altro dispositivo, come il laptop o lo smartphone, che desidera connettersi a una rete Wi-Fi esistente.

source: When your browser sends an HTTP request to the webserver, it’s basically saying, “Hello, I’m a web browser, and I’d like to see the homepage of this website.”
it_it: Quando il browser invia una richiesta HTTP al server web, sta sostanzialmente dicendo: "Ciao, sono un browser web e vorrei vedere la homepage di questo sito web".
